app/controllers/bookings_controller.rb

SELECT "bookings".* FROM "bookings"
---
  def index
    @bookings = Booking.all