app/controllers/flights_controller.rb

SELECT "flights".* FROM "flights"
---
  def index
    @flights = Flight.all

INSERT INTO "flights" ("flight_number", "date", "origin", "destination", "plane_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["flight_number", "747"], ["date", Wed, 14 Sep 2016], ["origin", "SYD"], ["destination", "LND"], ["plane_id", 11], ["created_at", 2016-09-14 01:57:22 UTC], ["updated_at", 2016-09-14 01:57:22 UTC]]
---
  def create
    @flight = Flight.new(flight_params)

    respond_to do |format|
      if @flight.save

SELECT  "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def set_flight
      @flight = Flight.find(params[:id])