app/controllers/planes_controller.rb

SELECT "planes".* FROM "planes"
---
  def index
    @planes = Plane.all